Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction.#ctor(ConstructionSetBase*)
Construction

Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction.GetBuildingConstructionOverride(Autodesk.Revit.DB.Analysis.ConstructionType)
Gets the Building Construction override for a ConstructionType.
constructionType: The ConstructionType override value to get.
Returns: True if analytical construction properties specified in Constructions.xml are used for the given ConstructionType, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The ConstructionType is invalid.
Since: 2013

Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction.SetBuildingConstructionOverride(Autodesk.Revit.DB.Analysis.ConstructionType,System.Boolean)
Sets the Building Construction override for a ConstructionType.
constructionType: The ConstructionType to override.
override: True to use analytical construction properties specified in Constructions.xml in the given ConstructionType, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The ConstructionType is invalid.
Since: 2013

Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction.SetBuildingConstruction(Autodesk.Revit.DB.Analysis.ConstructionType,Autodesk.Revit.DB.Construction)
Sets the Building Construction of the Project Information.
Remarks: This function is used to set the Building Construction of the Project Information.
constructionType: The Construction Type of Building Construction.
buildingConstruction: The Building Construction to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
buildingConstruction is NULL.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Sets construction type to an invalid value.
- or -
Can not set construction type.

Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction.GetBuildingConstruction(Autodesk.Revit.DB.Analysis.ConstructionType)
Gets the current Building Construction from the project information.
Remarks: This function is used to get the Building Construction of the Project Information.
constructionType: The Construction Type of Building Construction.
Returns: The Building Construction of the Project Information.

Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction.GetConstructions(Autodesk.Revit.DB.Analysis.ConstructionType)
Gets all the Building Constructions corresponding to the specific Construction type.
Remarks: This function is used to get the Building Construction of the Project Information.
constructionType: The Construction Type of Building Construction.
Returns: A collection containing Building constructions matching the construction type.

Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction
Construction definition for Project Information.
Remarks: This is used to define the information in Constructions.xml.